/*
СИМВОЛЫ
Написать программу, выводящую таблицу символов и их кодов с номерами от 32 до 255 в кодировочной таблице 866.
*/
#include <iostream>
using namespace std;

int main()
{
    for(char a = 32; a >= 32; a++)
    cout << a;
    cout << endl;
}